# SQL: consumo consultas mediante ***vistas***:

### Importación de librerías:

In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine

### Conexión con la base de datos:

In [2]:
my_pass = os.getenv("db_pass")
my_db = os.getenv("db_name")
my_user = os.getenv("db_user")

engine = create_engine(f"postgresql://{my_user}:{my_pass}@localhost:5432/{my_db}")

### Creación de consulta mediante **vista:**

In [3]:
query = """
    SELECT 
    nombre_estudiante,
    edad,
    correo_electronico,
    nombre_carrera,
    nombre_facultad,
    nombre_curso
    FROM vista_general
    WHERE
    nombre_carrera = 'Ingeniería Civil'
"""

### Creación de dataframe:

In [4]:
df_estudiantes_ing_civil = pd.read_sql(query, engine)
df_estudiantes_ing_civil.head(5)

,nombre_estudiante,edad,correo_electronico,nombre_carrera,nombre_facultad,nombre_curso
0,José López,29.0,jlopez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
1,Mariana Torres,24.0,mtorres2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
2,Francisco Gómez,27.0,fgomez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
3,Silvia Ramírez,29.0,sramirez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
4,Javier Vargas,28.0,jvargas2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas

In [5]:
df_estudiantes_ing_civil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   nombre_estudiante   15 non-null     object
 1   edad                15 non-null     float64
 2   correo_electronico  15 non-null     object
 3   nombre_carrera      15 non-null     object
 4   nombre_facultad     15 non-null     object
 5   nombre_curso        15 non-null     object
dtypes: float64(1), object(5)
memory usage: 852.0+ bytes

### Creación de consulta # 2: visualizar estudiantes menores de 25:

In [6]:
query_02 = """
    SELECT 
    nombre_estudiante,
    edad,
    correo_electronico,
    nombre_carrera,
    nombre_facultad,
    nombre_curso
    FROM vista_general
    WHERE
    edad < 25
"""

In [7]:
df_estudiantes_menor_25 = pd.read_sql(query_02, engine)
df_estudiantes_menor_25

,nombre_estudiante,edad,correo_electronico,nombre_carrera,nombre_facultad,nombre_curso
0,Mariana Torres,24.0,mtorres2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
1,Diana Jiménez,23.0,djimenez2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
2,Clara Ortiz,22.0,cortiz2@example.com,Ingeniería Civil,Facultad de Ingeniería,Matemáticas Básicas
3,Alberto López,24.0,alopez3@example.com,Física,Facultad de Ciencias,Matemáticas Básicas
4,Patricia Martínez,23.0,pmartinez4@example.com,Matemáticas,Facultad de Ciencias,Matemáticas Básicas

### Creación de consulta # 3: visualizar estudiantes de la facultad **Física**:

In [8]:
query_03 = """
SELECT
nombre_estudiante,
fecha_nacimiento,
correo_electronico,
nombre_carrera
FROM 
vista_estudiantes
WHERE
nombre_carrera = 'Física'
"""

In [9]:
df_estudiantes_fisica = pd.read_sql(query_03, engine)
df_estudiantes_fisica

    nombre_estudiante fecha_nacimiento       correo_electronico nombre_carrera
0       Alberto López       2000-01-15      alopez3@example.com         Física
1      Marta González       1996-03-21   mgonzalez3@example.com         Física
2       Pedro Sánchez       1997-05-17    psanchez3@example.com         Física
3       Laura Jiménez       1995-07-12    ljimenez3@example.com         Física
4        Antonio Ruiz       1996-09-29       aruiz3@example.com         Física
5        Sara Herrera       1997-11-10    sherrera3@example.com         Física
6   Daniela Rodríguez       1995-02-25  drodriguez3@example.com         Física
7       Óscar Morales       2001-04-13    omorales3@example.com         Física
8      Claudia Vargas       1997-06-18     cvargas3@example.com         Física
9      Juan Fernández       1995-08-27  jfernandez3@example.com         Física
10       Carmen Ortiz       1996-10-08      cortiz3@example.com         Física
11    Rafael Martínez       1997-12-26   rmartinez3@example.com         Física
12       Esteban Soto       1995-03-30       esoto3@example.com         Física
13     Pilar Castillo       2000-05-14   pcastillo3@example.com         Física
14        Marcos León       1997-07-11       mleon3@example.com         Física